app/Controllers/Home.php

INSERT INTO `leaf` (`leaf_no`, `upper_leaf`, `middle_leaf`, `lower_leaf`, `total_avg`, `upper_avg`, `middle_avg`, `lower_avg`, `avg_all`, `insect_id`) VALUES ('465846', '446', '4644', '4644', 0, 0, 0, 0, 0, 1)
---



   $db->table('leaf')->insert(['leaf_no' => $leaf_no, 'upper_leaf' => $upper_leaf, 'middle_leaf' => $middle_leaf,'lower_leaf' => $lower_leaf,'total_avg' => $total_avg,'upper_avg' => $upper_avg,'middle_avg' => $middle_avg,'lower_avg' => $lower_avg,'avg_all' => $avg_all,'insect_id' => $insect_id,]);