app/Models/Rmodel.php

SELECT `crops`.*, `sowing`.`sowing_date` as `sowing_date`, `sowing`.`planting_date` as `planntingdate`, `plot`.`replication` as `replication`, `plot`.`blanket_app` as `blanket_app`, `crops`.*, `plot`.`plot_size` as `plotsize`, `plot`.`previous_app` as `previousapplication`, `plot`.`irragtion_date` as `Irragtiondate`, `plot`.`location` as `location`, `trial`.`protocol_no` as `protocol`
FROM `crops`
JOIN `sowing` as `sowing` ON `crops`.`id` = `sowing`.`crop_id`
JOIN `plot` as `plot` ON `crops`.`id` = `plot`.`crop_id`
RIGHT JOIN `trial` as `trial` ON `trial`.`crop_id` = `plot`.`crop_id`
---
public function crop()
{
  $builder = $this->db->table("crops");
  $builder->select('crops.*, sowing.sowing_date as sowing_date, sowing.planting_date as planntingdate, plot.replication as replication, plot.blanket_app as blanket_app');

  $builder->select('crops.*, plot.plot_size as plotsize, plot.previous_app as previousapplication, plot.irragtion_date as Irragtiondate , plot.location as location,trial.protocol_no as protocol');
  $builder->join('sowing as sowing', 'crops.id = sowing.crop_id');
  $builder->join('plot as plot', 'crops.id = plot.crop_id');
  $builder->join('trial as trial', 'trial.crop_id = plot.crop_id','right');
  $data = $builder->get()->getResult();

SELECT *
FROM `crops`
INNER JOIN `treatment` ON `crops`.`id` = `treatment`.`crop_id`
---
public function trial_view(  )
{
     $db = \Config\Database::Connect();



 $builder=$db->table('crops');
$query=$builder->select('*')
->join('treatment', 'crops.id = treatment.crop_id','inner')
//->join('disease', 'crops.id = disease.crop_id','left')

->get()->getResult();